---
title: PhotometricWebLightDistribution
classe: Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution
namespace: Autodesk.Revit.DB.Lighting
eredita: Autodesk.Revit.DB.Lighting.LightDistribution
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# PhotometricWebLightDistribution

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String PhotometricWebFile { get; set; }` | `photometricWebLightDistribution.PhotometricWebFile` | String |
| `Double TiltAngle { get; set; }` | `photometricWebLightDistribution.TiltAngle` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```